modm-ext/data.modm.io/docs/svd/header_stm32f423xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <description>AES hardware accelerator</description>
      <baseAddress>0x50060000</baseAddress>
      <interrupt>
        <name>AES</name>
        <description>AES global Interrupt</description>
        <value>79</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>AES control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SR</name>
          <description>AES status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DINR</name>
          <description>AES data input register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DOUTR</name>
          <description>AES data output register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>KEYR0</name>
          <description>AES key register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>KEYR1</name>
          <description>AES key register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>KEYR2</name>
          <description>AES key register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>KEYR3</name>
          <description>AES key register 3</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IVR0</name>
          <description>AES initialization vector register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IVR1</name>
          <description>AES initialization vector register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IVR2</name>
          <description>AES initialization vector register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IVR3</name>
          <description>AES initialization vector register 3</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>KEYR4</name>
          <description>AES key register 4</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>KEYR5</name>
          <description>AES key register 5</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>KEYR6</name>
          <description>AES key register 6</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>KEYR7</name>
          <description>AES key register 7</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SUSP0R</name>
          <description>AES Suspend register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SUSP1R</name>
          <description>AES Suspend register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SUSP2R</name>
          <description>AES Suspend register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SUSP3R</name>
          <description>AES Suspend register 3</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SUSP4R</name>
          <description>AES Suspend register 4</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SUSP5R</name>
          <description>AES Suspend register 5</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SUSP6R</name>
          <description>AES Suspend register 6</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SUSP7R</name>
          <description>AES Suspend register 7</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <description>RNG</description>
      <baseAddress>0x50060800</baseAddress>
      <interrupt>
        <name>RNG</name>
        <description>RNG global Interrupt</description>
        <value>80</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>RNG control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNGEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>RNG status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DRDY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CECS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>RNG data register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
        </register>
